<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>以手筑城</title>
  <subtitle>以手筑城</subtitle>
  <link href="/atom.xml" rel="self"/>
  
  <link href="http://www.chengquanwei.com/"/>
  <updated>2016-08-06T16:50:03.530Z</updated>
  <id>http://www.chengquanwei.com/</id>
  
  <author>
    <name>以手筑城</name>
    <email>1170001884@qq.com</email>
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>关于javascript的一些知识总结</title>
    <link href="http://www.chengquanwei.com/2016/08/07/%E5%85%B3%E4%BA%8Ejavascript%E7%9A%84%E4%B8%80%E4%BA%9B%E7%9F%A5%E8%AF%86%E6%80%BB%E7%BB%93/"/>
    <id>http://www.chengquanwei.com/2016/08/07/关于javascript的一些知识总结/</id>
    <published>2016-08-06T16:48:56.000Z</published>
    <updated>2016-08-06T16:50:03.530Z</updated>
    
    <content type="html"><![CDATA[<p>&#x80CC;&#x666F;&#xFF1A;&#x516C;&#x53F8;&#x89C9;&#x5F97;extjs&#x6846;&#x67B6;&#x8FD0;&#x884C;&#x7684;&#x6162;&#x7279;&#x522B;&#x662F;&#x767B;&#x9646;&#x9875;&#x9762;&#x7684;&#x663E;&#x793A;&#xFF0C;&#x9700;&#x8981;20&#x79D2;&#x5DE6;&#x53F3;&#xFF0C;&#x8001;&#x677F;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x629B;&#x5F03;&#x6846;&#x67B6;&#xFF0C;&#x7528;jquery&#x6765;&#x5199;&#xFF0C;&#x7136;&#x540E;&#x4E8C;&#x8BDD;&#x4E0D;&#x8BF4;&#x5C31;&#x5F00;&#x59CB;&#x505A;&#x3002;&#x4E00;&#x4E2A;&#x6708;&#x7684;&#x9B54;&#x9B3C;&#x8BAD;&#x7EC3;&#xFF0C;&#x4E5F;&#x5B66;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x4EE5;&#x524D;&#x6CA1;&#x63A5;&#x89E6;&#x8FC7;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x611F;&#x89C9;&#x53D7;&#x76CA;&#x532A;&#x6D45;&#xFF0C;&#x603B;&#x7ED3;&#x4E00;&#x4E9B;&#xFF0C;&#x4EE5;&#x5907;&#x4E0D;&#x65F6;&#x4E4B;&#x9700;&#x3002;<br>1.&#x4E8B;&#x4EF6;&#x6355;&#x83B7;&#x548C;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;<br>     &#x9879;&#x76EE;&#x4E2D;&#x6709;&#x65F6;&#x5019;&#x8981;&#x52A8;&#x6001;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x5143;&#x7D20;&#xFF0C;&#x6BD4;&#x5982;table&#x6216;&#x4E0B;&#x62C9;&#x6846;&#x7684;&#x5143;&#x7D20;li&#xFF0C;&#x4F46;&#x6DFB;&#x52A0;&#x540E;&#x65E0;&#x6CD5;&#x83B7;&#x53D6;&#x52A8;&#x6001;&#x6DFB;&#x52A0;&#x7684;&#x5143;&#x7D20;&#x5C5E;&#x6027;&#xFF0C;&#x7F51;&#x4E0A;&#x627E;&#x4E86;&#x4E00;&#x4E9B;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF1A;&#x4E00;&#x662F;&#x5728;&#x52A8;&#x6001;&#x6DFB;&#x52A0;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;&#xFF0C;&#x7B2C;&#x4E8C;&#x79CD;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x4E8B;&#x4EF6;&#x6355;&#x83B7;&#x7684;&#x65B9;&#x5F0F;&#x83B7;&#x53D6;&#x5176;&#x52A8;&#x6001;&#x6DFB;&#x52A0;&#x7684;&#x5143;&#x7D20;&#x5C5E;&#x6027;&#x3002;&#x6240;&#x8C13;&#x4E8B;&#x4EF6;&#x6355;&#x83B7;&#x5C31;&#x662F;&#x5F53;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x65F6;&#x4ECE;&#x9876;&#x5C42;&#x5143;&#x7D20;&#xFF08;document &#x5BF9;&#x8C61;&#xFF09;&#x5C42;&#x5C42;&#x9012;&#x5F52;&#x5230;&#x76EE;&#x6807;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;&#x5219;&#x662F;&#x4ECE;&#x4ECE;&#x5E95;&#x5C42;&#x7684;&#x5143;&#x7D20;&#x4E00;&#x76F4;&#x5230;&#x9876;&#x5C42;&#x5143;&#x7D20;&#xFF08;document &#x5BF9;&#x8C61;&#xFF09;[&#x6240;&#x8C13;&#x9876;&#x5C42;&#x548C;&#x5E95;&#x5C42;&#x662F;&#x76F8;&#x5BF9;dom&#x6811;&#x800C;&#x8A00;]&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x90E8;&#x5206;&#x6D41;&#x884C;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x652F;&#x6301;&#x8FD9;&#x4E24;&#x79CD;&#x4E8B;&#x4EF6;&#xFF08;&#x4F60;&#x8BF4;&#x4EC0;&#x4E48;&#xFF1F;IE&#xFF0C;&#x522B;&#x63D0;IE[IE&#x53EA;&#x652F;&#x6301;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;]&#xFF0C;&#x6211;&#x4E0D;&#x8BA4;&#x4E3A;&#x5B83;&#x5F88;&#x6D41;&#x884C;&#xFF09;&#xFF0C;&#x5728;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x4E2D;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x6307;&#x5B9A;&#x5728;&#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;&#x65F6;&#x662F;&#x4F7F;&#x7528;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;&#x6216;&#x4E8B;&#x4EF6;&#x6355;&#x83B7;&#xFF0C;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5728;&#x5411;&#x6307;&#x5B9A;&#x5143;&#x7D20;&#x6DFB;&#x52A0;&#x4E8B;&#x4EF6;&#x53E5;&#x67C4;&#x65F6;&#x8BBE;&#x7F6E;addEventListener&#xFF08;event, function, useCapture&#xFF09;&#x7B2C;&#x4E09;&#x4E2A;&#x5C5E;&#x6027;&#x503C;&#x4E3A;true&#x6216;false&#xFF0C;</p>
<pre><code>true - &#x4E8B;&#x4EF6;&#x53E5;&#x67C4;&#x5728;&#x6355;&#x83B7;&#x9636;&#x6BB5;&#x6267;&#x884C;
false- false- &#x9ED8;&#x8BA4;&#x3002;&#x4E8B;&#x4EF6;&#x53E5;&#x67C4;&#x5728;&#x5192;&#x6CE1;&#x9636;&#x6BB5;&#x6267;&#x884C;
</code></pre><p>&#x5728;&#x540E;&#x6765;&#x9047;&#x5230;&#x4E0B;&#x62C9;&#x6846;&#x70B9;&#x51FB;&#x522B;&#x5904;&#x4E0D;&#x80FD;&#x9690;&#x85CF;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x4E5F;&#x662F;&#x6839;&#x636E;&#x4E8B;&#x4EF6;&#x6355;&#x83B7;&#x6765;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x89E3;&#x51B3;&#x7684;&#x4EE3;&#x7801;&#x660E;&#x5929;&#x4ECE;&#x516C;&#x53F8;&#x62F7;&#x8D1D;&#x8FC7;&#x6765;&#x7528;&#x5427;<br>2&#xFF0C;js&#x6570;&#x7EC4;&#x548C;json&#x7684;&#x4F7F;&#x7528;<br>     &#x5728;&#x505A;&#x591A;&#x9009;&#x4E0B;&#x62C9;&#x6846;&#x7684;&#x65F6;&#x5019;&#x5229;&#x7528;&#x6570;&#x7EC4;&#x6765;&#x64CD;&#x4F5C;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x7528;&#x96C6;&#x5408;&#x3001;json&#x6216;&#x662F;&#x5176;&#x5B83;&#x7C7B;&#x578B;&#x6765;&#x64CD;&#x4F5C;&#x5462;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x548C;&#x9879;&#x76EE;&#x6709;&#x5173;&#xFF0C;&#x5728;&#x53D6;&#x4E0B;&#x62C9;&#x6846;&#x503C;&#x7684;&#x65F6;&#x5019;&#x662F;&#x8981;&#x53D6;&#x51FA;&#x5176;&#x5BF9;&#x5E94;&#x7684;value&#x6570;&#x7EC4;&#x503C;&#x4F20;&#x5230;&#x540E;&#x53F0;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x7EC4;&#x7684;&#x64CD;&#x4F5C;&#x4E3B;&#x8981;&#x662F;&#x589E;&#x52A0;&#x5143;&#x7D20;&#x548C;&#x5220;&#x9664;&#x5143;&#x7D20;&#xFF1A;&#x589E;&#x52A0;&#x5143;&#x7D20;&#x5F88;&#x7B80;&#x5355;&#xFF0C;js&#x6709;&#x76F8;&#x5E94;&#x7684;&#x65B9;&#x6CD5;push&#xFF08;&#xFF09;&#xFF0C;&#x4F46;&#x4EE4;&#x6211;&#x90C1;&#x95F7;&#x7684;&#x662F;&#x5220;&#x9664;&#x5462;&#xFF0C;js&#x6CA1;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x65B9;&#x6CD5;&#x5417;&#xFF1F;,&#x7136;&#x800C;&#x627E;&#x4E86;&#x597D;&#x4E45;&#x6CA1;&#x627E;&#x5230;&#xFF0C;&#x5C31;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x884C;&#x5F97;&#x901A;&#x7684;&#x65B9;&#x6CD5;:array.splice($.inArray(value),1);&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x6570;&#x7EC4;&#x4E2D;&#x7684;value&#x503C;&#x3002;<br>     json&#x7684;&#x4F7F;&#x7528;&#x662F;&#x975E;&#x5E38;&#x9891;&#x7E41;&#x7684;&#xFF0C;&#x9879;&#x76EE;&#x4E2D;&#x4F20;&#x5230;&#x540E;&#x53F0;&#x7684;&#x7C7B;&#x578B;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x548C;json&#x76F8;&#x5173;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x57FA;&#x7840;&#x7684;&#x589E;&#x52A0;key-value&#x952E;&#x503C;&#x5BF9;&#x3001;&#x5220;&#x9664;&#x7279;&#x5B9A;&#x5143;&#x7D20;&#x548C;&#x5BF9;&#x7279;&#x5B9A;key&#x8D4B;&#x503C;<br>json&#xFF1A;</p>
<pre><code>&#x589E;&#x52A0;&#xFF1A;jsonObject[&quot;key&quot;] = &quot;value&quot;
&#x8D4B;&#x503C; : jsonObject.key=&quot;value&quot;
&#x5220;&#x9664; : delete jsonObject.value
</code></pre><p>&#x5728;&#x4F20;&#x5230;&#x540E;&#x53F0;&#x65F6;&#x5982;&#x679C;&#x540E;&#x53F0;&#x7528;String&#x6765;&#x63A5;&#x6536;&#x65F6;&#xFF0C;json&#x9700;&#x8981;&#x8F6C;&#x6362;&#x6210;&#x5B57;&#x7B26;&#x4E32;&#x5F62;&#x5F0F;&#x4F20;&#x7ED9;&#x540E;&#x53F0;&#xFF0C;json&#x8F6C;&#x6362;&#x6210;String&#x53EF;&#x4EE5;&#x7528;json.stringify&#xFF08;&#xFF09;&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;<br>&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x95EE;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8F6C;&#x6765;&#x8F6C;&#x53BB;&#x8FD9;&#x4E48;&#x9EBB;&#x70E6;&#x5462;&#xFF0C;&#x539F;&#x5148;&#x6211;&#x4E5F;&#x662F;&#x8FD9;&#x4E2A;&#x7591;&#x95EE;&#xFF0C;&#x4F46;&#x540E;&#x6765;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4F7F;&#x6211;&#x4F3C;&#x4E4E;&#x660E;&#x767D;&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;js&#x5728;&#x7EC4;&#x88C5;json&#x7684;&#x65F6;&#x5019;&#x7EC4;&#x88C5;&#x7684;&#x7C7B;&#x578B;&#x6709;int&#x548C;Date&#x7C7B;&#x578B;&#xFF0C;&#x6211;&#x5C06;json&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x4F20;&#x7ED9;&#x540E;&#x53F0;&#x7684;Model&#x5BF9;&#x8C61;&#x63A5;&#x6536;&#xFF0C;&#x53EF;&#x4EE5;&#x600E;&#x4E48;&#x4E5F;&#x4F20;&#x4E0D;&#x8FC7;&#x53BB;&#xFF0C;console&#x4E00;&#x76F4;&#x5728;&#x62A5;500&#x9519;&#x8BEF;&#xFF0C;&#x540E;&#x6765;&#x5728;&#x7F51;&#x4E0A;&#x627E;&#x5230;&#x7684;&#x7B54;&#x6848;&#x662F;json&#x5728;&#x542B;&#x6709;int&#x548C;&#x65E5;&#x671F;&#x7C7B;&#x578B;&#x662F;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x4F20;&#x7ED9;&#x540E;&#x53F0;&#x5BF9;&#x8C61;&#x7684;&#x3002;<br>3.js&#x4F5C;&#x7528;&#x57DF;&#x94FE;</p>
]]></content>
    
    <summary type="html">
    
      &lt;p&gt;&amp;#x80CC;&amp;#x666F;&amp;#xFF1A;&amp;#x516C;&amp;#x53F8;&amp;#x89C9;&amp;#x5F97;extjs&amp;#x6846;&amp;#x67B6;&amp;#x8FD0;&amp;#x884C;&amp;#x7684;&amp;#x6162;&amp;#x7279;&amp;#x522B;&amp;#x662F;&amp;#x7
    
    </summary>
    
      <category term="post" scheme="http://www.chengquanwei.com/categories/post/"/>
    
    
      <category term="javascript" scheme="http://www.chengquanwei.com/tags/javascript/"/>
    
  </entry>
  
  <entry>
    <title>垃圾回收机制</title>
    <link href="http://www.chengquanwei.com/2016/07/24/%E5%9E%83%E5%9C%BE%E5%9B%9E%E6%94%B6%E6%9C%BA%E5%88%B6/"/>
    <id>http://www.chengquanwei.com/2016/07/24/垃圾回收机制/</id>
    <published>2016-07-23T17:28:41.000Z</published>
    <updated>2016-07-24T06:42:17.209Z</updated>
    
    <content type="html"><![CDATA[<p>&#x516C;&#x53F8;&#x9879;&#x76EE;&#x9700;&#x8981;&#x4F18;&#x5316;&#xFF0C;&#x5C31;&#x770B;&#x4E86;&#x4E0B;js&#x548C;Java&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x3002;<br>&#x5728;&#x8FD9;&#x91CC;&#x5148;&#x8BB0;&#x4E0B;&#x8FD9;&#x51E0;&#x5929;&#x5BF9;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x7406;&#x89E3;&#x4E0D;&#x8DB3;&#x548C;&#x9519;&#x8BEF;&#x7684;&#x5730;&#x65B9;&#x65E5;&#x540E;&#x518D;&#x6162;&#x6162;&#x4FEE;&#x6539;&#x3002;<br>js&#x548C;Java&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#xFF0C;&#x4F46;&#x53C8;&#x6709;&#x4E9B;&#x4E0D;&#x540C;&#xFF0C;&#x4E0B;&#x9762;&#x4F9D;&#x6B21;&#x4ECB;&#x7ECD;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x51E0;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF0C;&#x518D;&#x5404;&#x81EA;&#x4ECB;&#x7ECD;js&#x548C;Java&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x4EE5;&#x4F5C;&#x5BF9;&#x6BD4;&#x3002;<br><a id="more"></a><br>&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x7684;&#x4E3B;&#x8981;&#x4EFB;&#x52A1;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x6E05;&#x7406;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x65E0;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x548C;&#x6574;&#x7406;&#x5185;&#x5B58;&#x3002;<br>&#x5783;&#x573E;&#x6536;&#x96C6;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x81F3;&#x4ECA;&#x5DF2;&#x6709;&#x51E0;&#x5341;&#x5E74;&#xFF0C;&#x6700;&#x7ECF;&#x5178;&#x4E5F;&#x662F;&#x6700;&#x57FA;&#x7840;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x6709;&#x4EE5;&#x4E0B;&#x4E09;&#x79CD;&#xFF1A;</p>
<h1 id="&#x5F15;&#x7528;&#x8BA1;&#x6570;"><a href="#&#x5F15;&#x7528;&#x8BA1;&#x6570;" class="headerlink" title="&#x5F15;&#x7528;&#x8BA1;&#x6570;"></a>&#x5F15;&#x7528;&#x8BA1;&#x6570;</h1><pre><code>    &#x5F15;&#x7528;&#x8BA1;&#x6570;&#xFF08;Reference Counting&#xFF09;&#x7B97;&#x6CD5;&#x5F88;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x5C31;&#x662F;&#x8BB0;&#x5F55;&#x6BCF;&#x4E2A;&#x503C;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x6B21;&#x6570;&#x3002;&#x5F53;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5E76;&#x5C06;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x8D4B;&#x503C;&#x7ED9;&#x8BE5;&#x53D8;&#x91CF;&#xFF0C;&#x8BE5;&#x503C;&#x7684;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x53D8;&#x4E3A;1&#xFF1B;&#x5982;&#x679C;&#x5F15;&#x7528;&#x8BE5;&#x503C;
&#x7684;&#x53D8;&#x91CF;&#x53BB;&#x5F15;&#x7528;&#x53E6;&#x5916;&#x7684;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x539F;&#x5148;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x503C;&#x7684;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x5C31;&#x51CF;1&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x503C;&#x7684;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x53D8;&#x4E3A;0&#xFF0C;&#x8BF4;&#x660E;&#x8BE5;&#x503C;&#x5DF2;&#x53D8;&#x4E3A;&#x65E0;&#x7528;&#x5BF9;&#x8C61;&#xFF0C;&#x5728;&#x4E0B;&#x6B21;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x4F1A;&#x56DE;&#x6536;&#x8BE5;&#x90A3;&#x4E9B;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x4E3A;
&#x96F6;&#x7684;&#x503C;&#x6240;&#x5360;&#x7684;&#x5185;&#x5B58;&#x3002;
    &#x5F15;&#x7528;&#x8BA1;&#x6570;&#x7B97;&#x6CD5;&#x6709;&#x4E00;&#x4E2A;&#x81F4;&#x547D;&#x7684;&#x7F3A;&#x9677;&#xFF1A;&#x5B83;&#x65E0;&#x6CD5;&#x51C6;&#x786E;&#x65E0;&#x8BEF;&#x5730;&#x5B9E;&#x73B0;&#x5783;&#x573E;&#x5224;&#x65AD;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x88AB;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x4E3A;0&#xFF0C;&#x5B83;&#x80AF;&#x5B9A;&#x662F;&#x5783;&#x573E;&#xFF0C;&#x4F46;&#x662F;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x4E0D;&#x4E3A;0&#x65F6;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#x4E0D;&#x662F;&#x5783;&#x573E;&#xFF0C;&#x6240;&#x4EE5;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x4E0D;&#x80FD;&#x91CA;
&#x653E;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x7684;&#x5185;&#x5B58;&#x5757;&#x3002;
</code></pre><h1 id="&#x6807;&#x8BB0;&#x6E05;&#x9664;"><a href="#&#x6807;&#x8BB0;&#x6E05;&#x9664;" class="headerlink" title="&#x6807;&#x8BB0;&#x6E05;&#x9664;"></a>&#x6807;&#x8BB0;&#x6E05;&#x9664;</h1><pre><code>    &#x6807;&#x8BB0;&#x6E05;&#x9664;&#xFF08;Mark-Sweep&#xFF09;&#x7B97;&#x6CD5;&#x539F;&#x7406;&#x662F;&#x5F53;&#x5783;&#x573E;&#x8981;&#x56DE;&#x6536;&#x65E0;&#x7528;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x5148;&#x8BA9;&#x7A0B;&#x5E8F;&#x6682;&#x505C;&#x4E0B;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x6839;&#x904D;&#x5386;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5BF9;&#x90A3;&#x4E9B;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x6253;&#x4E0A;&#x8BB0;&#x53F7;&#xFF0C;&#x6807;&#x8BB0;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x5783;
&#x573E;&#x56DE;&#x6536;&#x5668;&#x518D;&#x4E00;&#x6B21;&#x904D;&#x5386;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x6E05;&#x9664;&#x90A3;&#x4E9B;&#x6CA1;&#x6709;&#x88AB;&#x6807;&#x8BB0;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x3002;
</code></pre><h1 id="&#x590D;&#x5236;"><a href="#&#x590D;&#x5236;" class="headerlink" title="&#x590D;&#x5236;"></a>&#x590D;&#x5236;</h1><pre><code>&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#xFF1A;&#x76F4;&#x63A5;&#x5C06;&#x5806;&#x5185;&#x5B58;&#x5206;&#x4E3A;&#x5927;&#x5C0F;&#x76F8;&#x540C;&#x7684;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x5047;&#x5982;&#x5206;&#x4E3A;A&#x533A;&#x548C;B&#x533A;&#x3002;&#x5728;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x53EA;&#x4F7F;&#x7528;A&#x533A;&#x5185;&#x5B58;&#x53BB;&#x5B58;&#x50A8;&#x5BF9;&#x8C61;&#xFF1B;&#x5F53;&#x8981;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x65F6;&#xFF0C;&#x5C06;&#x6240;&#x6709;&#x53EF;&#x7528;&#x5BF9;&#x8C61;&#x590D;&#x5236;&#x5230;B&#x533A;&#x5185;&#x5B58;&#xFF0C;
&#x5B8C;&#x6210;&#x590D;&#x5236;&#x540E;&#xFF0C;&#x518D;&#x5C06;&#x6574;&#x4E2A;A&#x533A;&#x5185;&#x5B58;&#x56DE;&#x6536;&#x3002;
</code></pre><h1 id="JavaScirpt-&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;"><a href="#JavaScirpt-&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;" class="headerlink" title="JavaScirpt &#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;"></a>JavaScirpt &#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;</h1><pre><code>    Javascript&#x5F15;&#x64CE;&#x6240;&#x91C7;&#x7528;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B56;&#x7565;&#x4E3B;&#x8981;&#x662F;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x3002;&#x800C;&#x5927;&#x90E8;&#x5206;&#x6D4F;&#x89C8;&#x5668;&#x6807;&#x8BB0;&#x65B9;&#x5F0F;&#x662F;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x4F1A;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x7ED9;&#x5B58;&#x50A8;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x90FD;&#x52A0;&#x4E0A;&#x6807;&#x8BB0;&#x3002;&#x7136;&#x540E;&#x518D;&#x53BB;&#x6389;&#x90A3;&#x4E9B;&#x73AF;
&#x5883;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x4EE5;&#x53CA;&#x88AB;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x5F15;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x6807;&#x8BB0;&#xFF0C;&#x5F53;&#x904D;&#x5386;&#x5B8C;&#x6210;&#x540E;&#x5269;&#x4E0B;&#x4ECD;&#x5B58;&#x5728;&#x6807;&#x8BB0;&#x7684;&#x5C06;&#x88AB;&#x89C6;&#x4E3A;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x5728;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x6E05;&#x9664;&#x5185;&#x5B58;&#x5DE5;&#x4F5C;&#x65F6;&#xFF0C;&#x4F1A;&#x9500;&#x6BC1;&#x90A3;&#x4E9B;&#x5E26;&#x6807;&#x8BB0;&#x7684;&#x503C;&#x5E76;&#x56DE;&#x6536;&#x5B83;&#x4EEC;&#x6240;&#x5360;&#x7528;&#x7684;
 &#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x3002;
    &#x8FD9;&#x91CC;&#x6709;&#x5FC5;&#x8981;&#x8865;&#x5145;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x662F;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x6BD4;&#x5982;js&#x7A0B;&#x5E8F;&#x5728;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E14;&#x51FD;&#x6570;&#x4F53;&#x5185;&#x58F0;&#x660E;&#x4E86;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5219;&#x8BE5;&#x53D8;&#x91CF;&#x6B64;&#x65F6;&#x5C31;&#x662F;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#xFF1B;&#x5F53;&#x51FD;&#x6570;&#x6267;&#x884C;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x8BE5;&#x53D8;&#x91CF;&#x4E5F;&#x5C31;&#x79BB;&#x5F00;&#x4E86;&#x5F53;
&#x524D;&#x73AF;&#x5883;&#x53D8;&#x4E3A;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x7684;&#x53D8;&#x91CF;&#x3002;
    &#x5BF9;&#x4E8E;&#x4F4E;&#x7248;&#x672C;&#x7684;IE&#xFF08;&#x6709;&#x7684;&#x8BF4;&#x662F;IE6&#xFF0C;&#x6709;&#x7684;&#x8BF4;IE9+&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF09;&#xFF0C;js&#x8FD8;&#x91C7;&#x7528;&#x4E86;&#x53E6;&#x4E00;&#x79CD;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B56;&#x7565;&#xFF1A;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x3002;&#x5728;&#x4F4E;&#x7248;&#x672C;&#x7684;IE&#x4E2D;&#x5BF9;BOM&#x4E0E;DOM&#x5BF9;&#x8C61;&#x7684;&#x56DE;&#x6536;&#x662F;&#x901A;&#x8FC7;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x56DE;&#x6536;&#x5783;
&#x573E;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x4F4E;&#x7248;&#x672C;&#x7684;IE&#x4E2D;&#x53EA;&#x8981;&#x4F7F;&#x7528;BOM&#x53CA;DOM&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x95EE;&#x9898;&#x3002;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x8981;&#x5728;&#x4F7F;&#x7528;&#x5B8C;&#x540E;&#x5BF9;&#x76F8;&#x5E94;&#x7684;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x4E3A;null&#x5C31;&#x53EF;&#x89E3;&#x9664;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x3002;
</code></pre><h1 id="Java&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;"><a href="#Java&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;" class="headerlink" title="Java&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;"></a>Java&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;</h1><pre><code>&#x73B0;&#x884C;&#x7684;Java&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B56;&#x7565;&#x91C7;&#x7528;&#x7684;&#x662F;&#x57FA;&#x4E8E;&#x7EDF;&#x8BA1;&#x5206;&#x6790;&#x7684;&#x5206;&#x4EE3;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#x3002;&#x5206;&#x4EE3;&#x7684;&#x57FA;&#x672C;&#x601D;&#x8DEF;&#x662F;&#x6839;&#x636E;&#x5BF9;&#x8C61;&#x751F;&#x5B58;&#x65F6;&#x95F4;&#x7684;&#x957F;&#x77ED;&#xFF0C;&#x628A;&#x5806;&#x5185;&#x5B58;&#x5206;&#x4E3A;&#x4E09;&#x4EE3;&#xFF1A;Yong&#xFF0C;Old&#xFF0C;permanent&#x3002;
&#x4E0D;&#x540C;&#x4EE3;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF1A;
              Yong&#x4EE3;&#xFF1A;         &#x91C7;&#x7528;&#x590D;&#x5236;&#x7B97;&#x6CD5;
              Old&#x4EE3;&#xFF1A;            &#x91C7;&#x7528;&#x6807;&#x8BB0;&#x538B;&#x7F29;&#x7B97;&#x6CD5;
              Permanent&#x4EE3;: &#x7A0B;&#x5E8F;&#x5728;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x4E0D;&#x4F1A;&#x56DE;&#x6536;&#x8BE5;&#x5185;&#x5B58;
</code></pre>]]></content>
    
    <summary type="html">
    
      &lt;p&gt;&amp;#x516C;&amp;#x53F8;&amp;#x9879;&amp;#x76EE;&amp;#x9700;&amp;#x8981;&amp;#x4F18;&amp;#x5316;&amp;#xFF0C;&amp;#x5C31;&amp;#x770B;&amp;#x4E86;&amp;#x4E0B;js&amp;#x548C;Java&amp;#x7684;&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x673A;&amp;#x5236;&amp;#x3002;&lt;br&gt;&amp;#x5728;&amp;#x8FD9;&amp;#x91CC;&amp;#x5148;&amp;#x8BB0;&amp;#x4E0B;&amp;#x8FD9;&amp;#x51E0;&amp;#x5929;&amp;#x5BF9;&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x673A;&amp;#x5236;&amp;#x7684;&amp;#x7406;&amp;#x89E3;&amp;#xFF0C;&amp;#x7406;&amp;#x89E3;&amp;#x4E0D;&amp;#x8DB3;&amp;#x548C;&amp;#x9519;&amp;#x8BEF;&amp;#x7684;&amp;#x5730;&amp;#x65B9;&amp;#x65E5;&amp;#x540E;&amp;#x518D;&amp;#x6162;&amp;#x6162;&amp;#x4FEE;&amp;#x6539;&amp;#x3002;&lt;br&gt;js&amp;#x548C;Java&amp;#x7684;&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x975E;&amp;#x5E38;&amp;#x7C7B;&amp;#x4F3C;&amp;#xFF0C;&amp;#x4F46;&amp;#x53C8;&amp;#x6709;&amp;#x4E9B;&amp;#x4E0D;&amp;#x540C;&amp;#xFF0C;&amp;#x4E0B;&amp;#x9762;&amp;#x4F9D;&amp;#x6B21;&amp;#x4ECB;&amp;#x7ECD;&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x7684;&amp;#x51E0;&amp;#x79CD;&amp;#x5B9E;&amp;#x73B0;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF0C;&amp;#x518D;&amp;#x5404;&amp;#x81EA;&amp;#x4ECB;&amp;#x7ECD;js&amp;#x548C;Java&amp;#x7684;&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x673A;&amp;#x5236;&amp;#x4EE5;&amp;#x4F5C;&amp;#x5BF9;&amp;#x6BD4;&amp;#x3002;&lt;br&gt;&lt;/p&gt;
    
    </summary>
    
      <category term="post" scheme="http://www.chengquanwei.com/categories/post/"/>
    
    
      <category term="js" scheme="http://www.chengquanwei.com/tags/js/"/>
    
      <category term="Java" scheme="http://www.chengquanwei.com/tags/Java/"/>
    
      <category term="垃圾回收" scheme="http://www.chengquanwei.com/tags/%E5%9E%83%E5%9C%BE%E5%9B%9E%E6%94%B6/"/>
    
  </entry>
  
  <entry>
    <title>Markdown简用语法</title>
    <link href="http://www.chengquanwei.com/2016/07/17/Markdown%E7%AE%80%E7%94%A8%E8%AF%AD%E6%B3%95/"/>
    <id>http://www.chengquanwei.com/2016/07/17/Markdown简用语法/</id>
    <published>2016-07-17T14:30:45.000Z</published>
    <updated>2016-07-17T14:41:18.177Z</updated>
    
    <content type="html"><![CDATA[<ul>
<li><p>Markdown &#x662F;&#x4E00;&#x79CD;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x300C;&#x6807;&#x8BB0;&#x8BED;&#x8A00;&#x300D;*<br>&#x6807;&#x9898;&#x7528;#&#x53F7;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x4E00;&#x4E2A;#&#x53F7;&#x4EE3;&#x8868;&#x4E00;&#x7EA7;&#xFF0C;</p>
<h1 id="&#x4E00;&#x7EA7;&#x6807;&#x9898;"><a href="#&#x4E00;&#x7EA7;&#x6807;&#x9898;" class="headerlink" title="&#x4E00;&#x7EA7;&#x6807;&#x9898;"></a>&#x4E00;&#x7EA7;&#x6807;&#x9898;</h1><h2 id="&#x4E8C;&#x7EA7;&#x6807;&#x9898;"><a href="#&#x4E8C;&#x7EA7;&#x6807;&#x9898;" class="headerlink" title="&#x4E8C;&#x7EA7;&#x6807;&#x9898;"></a>&#x4E8C;&#x7EA7;&#x6807;&#x9898;</h2><h3 id="&#x4E09;&#x7EA7;&#x6807;&#x9898;"><a href="#&#x4E09;&#x7EA7;&#x6807;&#x9898;" class="headerlink" title="&#x4E09;&#x7EA7;&#x6807;&#x9898;"></a>&#x4E09;&#x7EA7;&#x6807;&#x9898;</h3><h4 id="&#x56DB;&#x7EA7;&#x6807;&#x9898;"><a href="#&#x56DB;&#x7EA7;&#x6807;&#x9898;" class="headerlink" title="&#x56DB;&#x7EA7;&#x6807;&#x9898;"></a>&#x56DB;&#x7EA7;&#x6807;&#x9898;</h4><h5 id="&#x4E94;&#x7EA7;&#x6807;&#x9898;"><a href="#&#x4E94;&#x7EA7;&#x6807;&#x9898;" class="headerlink" title="&#x4E94;&#x7EA7;&#x6807;&#x9898;"></a>&#x4E94;&#x7EA7;&#x6807;&#x9898;</h5><h6 id="&#x516D;&#x7EA7;&#x6807;&#x9898;"><a href="#&#x516D;&#x7EA7;&#x6807;&#x9898;" class="headerlink" title="&#x516D;&#x7EA7;&#x6807;&#x9898;"></a>&#x516D;&#x7EA7;&#x6807;&#x9898;</h6></li>
<li><p>&#x5217;&#x8868; <em><br>&#x65E0;&#x5E8F;&#x5217;&#x8868; -&#x6216;</em></p>
</li>
<li>1</li>
<li>2</li>
<li>3<br>&#x6709;&#x5E8F;&#x5217;&#x8868; 1. 2. 3.</li>
</ul>
<ol>
<li>1</li>
<li>2</li>
<li>3</li>
</ol>
<ul>
<li>&#x5F15;&#x7528;&gt; *<blockquote>
<p>&#x5E94;&#x7528;</p>
</blockquote>
</li>
<li>&#x56FE;&#x7247;&#x94FE;&#x63A5; *</li>
</ul>
<p>&#x56FE;&#x7247;&#x4E3A;&#xFF1A;<img src="/2016/07/17/Markdown&#x7B80;&#x7528;&#x8BED;&#x6CD5;/" alt="">{ImgCap}{/ImgCap}</p>
<p>&#x94FE;&#x63A5;&#x4E3A;&#xFF1A;<a href=""></a></p>
]]></content>
    
    <summary type="html">
    
      &lt;ul&gt;
&lt;li&gt;&lt;p&gt;Markdown &amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x8F7B;&amp;#x91CF;&amp;#x7EA7;&amp;#x7684;&amp;#x300C;&amp;#x6807;&amp;#x8BB0;&amp;#x8BED;&amp;#x8A00;&amp;#x300D;*&lt;br&gt;&amp;#x6807;&amp;#
    
    </summary>
    
      <category term="post" scheme="http://www.chengquanwei.com/categories/post/"/>
    
    
      <category term="Movies - Life" scheme="http://www.chengquanwei.com/tags/Movies-Life/"/>
    
  </entry>
  
  <entry>
    <title>如果天亮了</title>
    <link href="http://www.chengquanwei.com/2016/07/16/%E5%A6%82%E6%9E%9C%E5%A4%A9%E4%BA%AE%E4%BA%86/"/>
    <id>http://www.chengquanwei.com/2016/07/16/如果天亮了/</id>
    <published>2016-07-16T04:15:00.000Z</published>
    <updated>2016-07-17T14:31:34.498Z</updated>
    
    <content type="html"><![CDATA[<p>&#x5982;&#x679C;&#x5929;&#x4EAE;&#x4E86;&#xFF0C;<br>&#x5C31;&#x9192;&#x6765;&#x5427;&#xFF0C;<br>&#x671B;&#x671B;&#x8FDC;&#x5904;&#x7684;&#x4E00;&#x89D2;&#x5929;&#x8FB9;&#xFF0C;<br>&#x770B;&#x90A3;&#x91CC;&#x7F15;&#x7F15;&#x767D;&#x4E91;&#x7684;&#x5E7B;&#x60F3;&#xFF0C;<br>&#x80E1;&#x601D;&#x4E71;&#x60F3;&#x7740;&#x751F;&#x6D3B;&#x7684;&#x79CD;&#x79CD;&#xFF0C;<br>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7AD9;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;<br>&#x5B89;&#x7136;&#x800C;&#x9759;&#x8C27;&#xFF0C;<br>&#x7B49;&#x5F85;&#x7740;&#x63A5;&#x53D7;&#x9633;&#x5149;&#x7684;&#x660E;&#x5A9A;&#x3002;</p>
]]></content>
    
    <summary type="html">
    
      &lt;p&gt;&amp;#x5982;&amp;#x679C;&amp;#x5929;&amp;#x4EAE;&amp;#x4E86;&amp;#xFF0C;&lt;br&gt;&amp;#x5C31;&amp;#x9192;&amp;#x6765;&amp;#x5427;&amp;#xFF0C;&lt;br&gt;&amp;#x671B;&amp;#x671B;&amp;#x8FDC;&amp;#x5904;&amp;#x7684;&amp;
    
    </summary>
    
      <category term="post" scheme="http://www.chengquanwei.com/categories/post/"/>
    
    
      <category term="Life" scheme="http://www.chengquanwei.com/tags/Life/"/>
    
  </entry>
  
</feed>
