<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="以手筑城的个人博客">
    <meta name="keyword"  content="key# your keywords">
    <link rel="shortcut icon" href="/img/timg.jpeg">

    <title>
        
          关于javascript的一些知识总结｜以手筑城 blog
        
    </title>

    <link rel="canonical" href="http://www.chengquanwei.com/2016/08/07/关于javascript的一些知识总结/">

    <!-- Bootstrap Core CSS -->
    <link rel="stylesheet" href="/css/bootstrap.min.css">

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/blog-style.css">

    <!-- Pygments Github CSS -->
    <link rel="stylesheet" href="/css/syntax.css">

    <!-- Custom Fonts -->
    <link href="http://cdn.staticfile.org/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" type="text/css">


    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- ga & ba script hoook -->
    <script></script>
</head>

<style>
    .intro-header{
        background-image:url(
        'img/post-default.jpg'
        )
    }
</style>
<!-- hack iOS CSS :active style -->
<body ontouchstart="">
<!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top " data-ispost = "true" data-istags="false
" data-ishome = "false" >
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">
                <span class="brand-logo">
                    以手筑城
                </span>
                's Blog
            </a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <!-- Known Issue, found by Hux:
            <nav>'s height woule be hold on by its content.
            so, when navbar scale out, the <nav> will cover tags.
            also mask any touch event of tags, unfortunately.
        -->
        <!-- /.navbar-collapse -->
        <div id="huxblog_navbar">
            <div class="navbar-collapse">
                <ul class="nav navbar-nav navbar-right">
                    <li>
                        <a href="/">Home</a>
                    </li>

                    
                        
                        <li>
                            <a href="/about/">关于</a>
                        </li>
                        
                    
                        
                        <li>
                            <a href="/archives/">archives</a>
                        </li>
                        
                    
                        
                        <li>
                            <a href="/reading/">读书</a>
                        </li>
                        
                    
                        
                        <li>
                            <a href="/tags/">tags</a>
                        </li>
                        
                    

                </ul>
            </div>
        </div>
    </div>
    <!-- /.container -->
</nav>
<script>
    // Drop Bootstarp low-performance Navbar
    // Use customize navbar with high-quality material design animation
    // in high-perf jank-free CSS3 implementation
    var $body   = document.body;
    var $toggle = document.querySelector('.navbar-toggle');
    var $navbar = document.querySelector('#huxblog_navbar');
    var $collapse = document.querySelector('.navbar-collapse');

    $toggle.addEventListener('click', handleMagic)
    function handleMagic(e){
        if ($navbar.className.indexOf('in') > 0) {
        // CLOSE
            $navbar.className = " ";
            // wait until animation end.
            setTimeout(function(){
                // prevent frequently toggle
                if($navbar.className.indexOf('in') < 0) {
                    $collapse.style.height = "0px"
                }
            },400)
        }else{
        // OPEN
            $collapse.style.height = "auto"
            $navbar.className += " in";
        }
    }
</script>

    <!-- Main Content -->
    
<!-- Image to hack wechat -->
<!--only post-->
<img class="wechat-title-img" src="img/icon_wechat.jpg">

<!-- Post Header -->
<!-- only post bg-->
<style type="text/css">
    header.intro-header{
        background-image: url('img/post-default.jpgimg/timg.jpeg')
    }
</style>

<header class="intro-header" >
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1 text-center">
                <div class="post-heading">
                    <h1>关于javascript的一些知识总结</h1>
                    
                    <span class="meta">
                         作者 以手筑城
                         <span>
                          日期 2016-08-07
                         </span>
                    </span>
                    <div class="tags text-center">
                        
                        <a class="tag" href="/tags/#javascript" title="javascript">javascript</a>
                        
                    </div>
                </div>
            </div>
        </div>
    </div>
    <div class="post-title-haojen">
        <span>
            关于javascript的一些知识总结
        </span>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">
                <!-- Post Container -->
            <div class="col-lg-8 col-lg-offset-1 col-sm-9 post-container">

                <p>&#x80CC;&#x666F;&#xFF1A;&#x516C;&#x53F8;&#x89C9;&#x5F97;extjs&#x6846;&#x67B6;&#x8FD0;&#x884C;&#x7684;&#x6162;&#x7279;&#x522B;&#x662F;&#x767B;&#x9646;&#x9875;&#x9762;&#x7684;&#x663E;&#x793A;&#xFF0C;&#x9700;&#x8981;20&#x79D2;&#x5DE6;&#x53F3;&#xFF0C;&#x8001;&#x677F;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x629B;&#x5F03;&#x6846;&#x67B6;&#xFF0C;&#x7528;jquery&#x6765;&#x5199;&#xFF0C;&#x7136;&#x540E;&#x4E8C;&#x8BDD;&#x4E0D;&#x8BF4;&#x5C31;&#x5F00;&#x59CB;&#x505A;&#x3002;&#x4E00;&#x4E2A;&#x6708;&#x7684;&#x9B54;&#x9B3C;&#x8BAD;&#x7EC3;&#xFF0C;&#x4E5F;&#x5B66;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x4EE5;&#x524D;&#x6CA1;&#x63A5;&#x89E6;&#x8FC7;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x611F;&#x89C9;&#x53D7;&#x76CA;&#x532A;&#x6D45;&#xFF0C;&#x603B;&#x7ED3;&#x4E00;&#x4E9B;&#xFF0C;&#x4EE5;&#x5907;&#x4E0D;&#x65F6;&#x4E4B;&#x9700;&#x3002;<br><a id="more"></a><br>1.&#x4E8B;&#x4EF6;&#x6355;&#x83B7;&#x548C;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;<br>     &#x9879;&#x76EE;&#x4E2D;&#x6709;&#x65F6;&#x5019;&#x8981;&#x52A8;&#x6001;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x5143;&#x7D20;&#xFF0C;&#x6BD4;&#x5982;table&#x6216;&#x4E0B;&#x62C9;&#x6846;&#x7684;&#x5143;&#x7D20;li&#xFF0C;&#x4F46;&#x6DFB;&#x52A0;&#x540E;&#x65E0;&#x6CD5;&#x83B7;&#x53D6;&#x52A8;&#x6001;&#x6DFB;&#x52A0;&#x7684;&#x5143;&#x7D20;&#x5C5E;&#x6027;&#xFF0C;&#x7F51;&#x4E0A;&#x627E;&#x4E86;&#x4E00;&#x4E9B;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF1A;&#x4E00;&#x662F;&#x5728;&#x52A8;&#x6001;&#x6DFB;&#x52A0;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;&#xFF0C;&#x7B2C;&#x4E8C;&#x79CD;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x4E8B;&#x4EF6;&#x6355;&#x83B7;&#x7684;&#x65B9;&#x5F0F;&#x83B7;&#x53D6;&#x5176;&#x52A8;&#x6001;&#x6DFB;&#x52A0;&#x7684;&#x5143;&#x7D20;&#x5C5E;&#x6027;&#x3002;&#x6240;&#x8C13;&#x4E8B;&#x4EF6;&#x6355;&#x83B7;&#x5C31;&#x662F;&#x5F53;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x65F6;&#x4ECE;&#x9876;&#x5C42;&#x5143;&#x7D20;&#xFF08;document &#x5BF9;&#x8C61;&#xFF09;&#x5C42;&#x5C42;&#x9012;&#x5F52;&#x5230;&#x76EE;&#x6807;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;&#x5219;&#x662F;&#x4ECE;&#x4ECE;&#x5E95;&#x5C42;&#x7684;&#x5143;&#x7D20;&#x4E00;&#x76F4;&#x5230;&#x9876;&#x5C42;&#x5143;&#x7D20;&#xFF08;document &#x5BF9;&#x8C61;&#xFF09;[&#x6240;&#x8C13;&#x9876;&#x5C42;&#x548C;&#x5E95;&#x5C42;&#x662F;&#x76F8;&#x5BF9;dom&#x6811;&#x800C;&#x8A00;]&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x90E8;&#x5206;&#x6D41;&#x884C;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x652F;&#x6301;&#x8FD9;&#x4E24;&#x79CD;&#x4E8B;&#x4EF6;&#xFF08;&#x4F60;&#x8BF4;&#x4EC0;&#x4E48;&#xFF1F;IE&#xFF0C;&#x522B;&#x63D0;IE[IE&#x53EA;&#x652F;&#x6301;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;]&#xFF0C;&#x6211;&#x4E0D;&#x8BA4;&#x4E3A;&#x5B83;&#x5F88;&#x6D41;&#x884C;&#xFF09;&#xFF0C;&#x5728;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x4E2D;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x6307;&#x5B9A;&#x5728;&#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;&#x65F6;&#x662F;&#x4F7F;&#x7528;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;&#x6216;&#x4E8B;&#x4EF6;&#x6355;&#x83B7;&#xFF0C;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5728;&#x5411;&#x6307;&#x5B9A;&#x5143;&#x7D20;&#x6DFB;&#x52A0;&#x4E8B;&#x4EF6;&#x53E5;&#x67C4;&#x65F6;&#x8BBE;&#x7F6E;addEventListener&#xFF08;event, function, useCapture&#xFF09;&#x7B2C;&#x4E09;&#x4E2A;&#x5C5E;&#x6027;&#x503C;&#x4E3A;true&#x6216;false&#xFF0C;</p>
<pre><code>true - &#x4E8B;&#x4EF6;&#x53E5;&#x67C4;&#x5728;&#x6355;&#x83B7;&#x9636;&#x6BB5;&#x6267;&#x884C;
false- false- &#x9ED8;&#x8BA4;&#x3002;&#x4E8B;&#x4EF6;&#x53E5;&#x67C4;&#x5728;&#x5192;&#x6CE1;&#x9636;&#x6BB5;&#x6267;&#x884C;
</code></pre><p>&#x5728;&#x540E;&#x6765;&#x9047;&#x5230;&#x4E0B;&#x62C9;&#x6846;&#x70B9;&#x51FB;&#x522B;&#x5904;&#x4E0D;&#x80FD;&#x9690;&#x85CF;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x4E5F;&#x662F;&#x6839;&#x636E;&#x4E8B;&#x4EF6;&#x6355;&#x83B7;&#x6765;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x89E3;&#x51B3;&#x7684;&#x4EE3;&#x7801;&#x660E;&#x5929;&#x4ECE;&#x516C;&#x53F8;&#x62F7;&#x8D1D;&#x8FC7;&#x6765;&#x7528;&#x5427;<br>2&#xFF0C;js&#x6570;&#x7EC4;&#x548C;json&#x7684;&#x4F7F;&#x7528;<br>     &#x5728;&#x505A;&#x591A;&#x9009;&#x4E0B;&#x62C9;&#x6846;&#x7684;&#x65F6;&#x5019;&#x5229;&#x7528;&#x6570;&#x7EC4;&#x6765;&#x64CD;&#x4F5C;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x7528;&#x96C6;&#x5408;&#x3001;json&#x6216;&#x662F;&#x5176;&#x5B83;&#x7C7B;&#x578B;&#x6765;&#x64CD;&#x4F5C;&#x5462;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x548C;&#x9879;&#x76EE;&#x6709;&#x5173;&#xFF0C;&#x5728;&#x53D6;&#x4E0B;&#x62C9;&#x6846;&#x503C;&#x7684;&#x65F6;&#x5019;&#x662F;&#x8981;&#x53D6;&#x51FA;&#x5176;&#x5BF9;&#x5E94;&#x7684;value&#x6570;&#x7EC4;&#x503C;&#x4F20;&#x5230;&#x540E;&#x53F0;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x7EC4;&#x7684;&#x64CD;&#x4F5C;&#x4E3B;&#x8981;&#x662F;&#x589E;&#x52A0;&#x5143;&#x7D20;&#x548C;&#x5220;&#x9664;&#x5143;&#x7D20;&#xFF1A;&#x589E;&#x52A0;&#x5143;&#x7D20;&#x5F88;&#x7B80;&#x5355;&#xFF0C;js&#x6709;&#x76F8;&#x5E94;&#x7684;&#x65B9;&#x6CD5;push&#xFF08;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x5220;&#x9664;&#x9700;&#x8981;&#x6839;&#x636E;&#x5BF9;&#x5E94;&#x7684;&#x503C;&#x53BB;&#x5220;&#x9664;,&#x6211;&#x662F;&#x7528;&#x7684;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x5220;&#x9664;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;:array.splice($.inArray(value),1);&#x3002;<br>     json&#x7684;&#x4F7F;&#x7528;&#x662F;&#x975E;&#x5E38;&#x9891;&#x7E41;&#x7684;&#xFF0C;&#x9879;&#x76EE;&#x4E2D;&#x4F20;&#x5230;&#x540E;&#x53F0;&#x7684;&#x7C7B;&#x578B;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x548C;json&#x76F8;&#x5173;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x57FA;&#x7840;&#x7684;&#x589E;&#x52A0;key-value&#x952E;&#x503C;&#x5BF9;&#x3001;&#x5220;&#x9664;&#x7279;&#x5B9A;&#x5143;&#x7D20;&#x548C;&#x5BF9;&#x7279;&#x5B9A;key&#x8D4B;&#x503C;<br>json&#xFF1A;</p>
<pre><code>&#x589E;&#x52A0;&#xFF1A;jsonObject[&quot;key&quot;] = &quot;value&quot;
&#x8D4B;&#x503C; : jsonObject.key=&quot;value&quot;
&#x5220;&#x9664; : delete jsonObject.value
</code></pre><p>&#x5728;&#x4F20;&#x5230;&#x540E;&#x53F0;&#x65F6;&#x5982;&#x679C;&#x540E;&#x53F0;&#x7528;String&#x6765;&#x63A5;&#x6536;&#x65F6;&#xFF0C;json&#x9700;&#x8981;&#x8F6C;&#x6362;&#x6210;&#x5B57;&#x7B26;&#x4E32;&#x5F62;&#x5F0F;&#x4F20;&#x7ED9;&#x540E;&#x53F0;&#xFF0C;json&#x8F6C;&#x6362;&#x6210;String&#x53EF;&#x4EE5;&#x7528;json.stringify&#xFF08;&#xFF09;&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;<br>&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x95EE;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8F6C;&#x6765;&#x8F6C;&#x53BB;&#x8FD9;&#x4E48;&#x9EBB;&#x70E6;&#x5462;&#xFF0C;&#x539F;&#x5148;&#x6211;&#x4E5F;&#x662F;&#x8FD9;&#x4E2A;&#x7591;&#x95EE;&#xFF0C;&#x4F46;&#x540E;&#x6765;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4F7F;&#x6211;&#x4F3C;&#x4E4E;&#x660E;&#x767D;&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;js&#x5728;&#x7EC4;&#x88C5;json&#x7684;&#x65F6;&#x5019;&#x7EC4;&#x88C5;&#x7684;&#x7C7B;&#x578B;&#x6709;int&#x548C;Date&#x7C7B;&#x578B;&#xFF0C;&#x6211;&#x5C06;json&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x4F20;&#x7ED9;&#x540E;&#x53F0;&#x7684;Model&#x5BF9;&#x8C61;&#x63A5;&#x6536;&#xFF0C;&#x53EF;&#x4EE5;&#x600E;&#x4E48;&#x4E5F;&#x4F20;&#x4E0D;&#x8FC7;&#x53BB;&#xFF0C;console&#x4E00;&#x76F4;&#x5728;&#x62A5;500&#x9519;&#x8BEF;&#xFF0C;&#x540E;&#x6765;&#x5728;&#x7F51;&#x4E0A;&#x627E;&#x5230;&#x7684;&#x7B54;&#x6848;&#x662F;json&#x5728;&#x542B;&#x6709;int&#x548C;&#x65E5;&#x671F;&#x7C7B;&#x578B;&#x662F;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x4F20;&#x7ED9;&#x540E;&#x53F0;&#x5BF9;&#x8C61;&#x7684;&#x3002;<br>3.js&#x4F5C;&#x7528;&#x57DF;&#x94FE;<br>    &#x51FD;&#x6570;&#x5BF9;&#x8C61;&#x548C;&#x5176;&#x5B83;&#x5BF9;&#x8C61;&#x4E00;&#x6837;&#xFF0C;&#x62E5;&#x6709;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE3;&#x7801;&#x8BBF;&#x95EE;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x4E00;&#x7CFB;&#x5217;&#x4EC5;&#x4F9B;JavaScript&#x5F15;&#x64CE;&#x8BBF;&#x95EE;&#x7684;&#x5185;&#x90E8;&#x5C5E;&#x6027;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x5C5E;&#x6027;&#x662F; [[Scope]]&#xFF0C;&#x7531;ECMA-262&#x6807;&#x51C6;&#x7B2C;&#x4E09;&#x7248;&#x5B9A;&#x4E49;&#xFF0C;&#x8BE5;&#x5185;&#x90E8;&#x5C5E;&#x6027;&#x5305;&#x542B;&#x4E86;&#x51FD;&#x6570;&#x88AB;&#x521B;&#x5EFA;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x5BF9;&#x8C61;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x8FD9;&#x4E2A;&#x96C6;&#x5408;&#x88AB;&#x79F0;&#x4E3A;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#xFF0C;&#x5B83;&#x51B3;&#x5B9A;&#x4E86;&#x54EA;&#x4E9B;&#x6570;&#x636E;&#x80FD;&#x88AB;&#x51FD;&#x6570;&#x8BBF;&#x95EE;&#x3002;<br>&#x5F53;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x540E;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4F1A;&#x88AB;&#x521B;&#x5EFA;&#x6B64;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x53EF;&#x8BBF;&#x95EE;&#x7684;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x586B;&#x5145;&#x3002;&#x5728;&#x51FD;&#x6570;add&#x521B;&#x5EFA;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;&#x4F1A;&#x586B;&#x5165;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#xFF0C;&#x8BE5;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x5305;&#x542B;&#x4E86;&#x6240;&#x6709;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3002;<br>    &#x6267;&#x884C;&#x6B64;&#x51FD;&#x6570;&#x65F6;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x201C;&#x8FD0;&#x884C;&#x671F;&#x4E0A;&#x4E0B;&#x6587;(execution context)&#x201D;&#x7684;&#x5185;&#x90E8;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD0;&#x884C;&#x671F;&#x4E0A;&#x4E0B;&#x6587;&#x5B9A;&#x4E49;&#x4E86;&#x51FD;&#x6570;&#x6267;&#x884C;&#x65F6;&#x7684;&#x73AF;&#x5883;&#x3002;&#x6BCF;&#x4E2A;&#x8FD0;&#x884C;&#x671F;&#x4E0A;&#x4E0B;&#x6587;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#xFF0C;&#x7528;&#x4E8E;&#x6807;&#x8BC6;&#x7B26;&#x89E3;&#x6790;&#xFF0C;&#x5F53;&#x8FD0;&#x884C;&#x671F;&#x4E0A;&#x4E0B;&#x6587;&#x88AB;&#x521B;&#x5EFA;&#x65F6;&#xFF0C;&#x800C; &#x5B83;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x521D;&#x59CB;&#x5316;&#x4E3A;&#x5F53;&#x524D;&#x8FD0;&#x884C;&#x51FD;&#x6570;&#x7684;[[Scope]]&#x6240;&#x5305;&#x542B;&#x7684;&#x5BF9;&#x8C61;&#x3002;<br>&#x8FD9;&#x4E9B;&#x503C;&#x6309;&#x7167;&#x5B83;&#x4EEC;&#x51FA;&#x73B0;&#x5728;&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x987A;&#x5E8F;&#x88AB;&#x590D;&#x5236;&#x5230;&#x8FD0;&#x884C;&#x671F;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;&#x3002;&#x5B83;&#x4EEC;&#x5171;&#x540C;&#x7EC4;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x53EB;&#x201C;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;(activation object)&#x201D;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x5305;&#x542B;&#x4E86;&#x51FD;&#x6570;&#x7684;&#x6240;&#x6709;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3001;&#x547D;&#x540D;&#x53C2;&#x6570;&#x3001;&#x53C2;&#x6570;&#x96C6;&#x5408;&#x4EE5;&#x53CA;this&#xFF0C;&#x7136;&#x540E;&#x6B64;&#x5BF9;&#x8C61;&#x4F1A;&#x88AB;&#x63A8;&#x5165;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x7684;&#x524D;&#x7AEF;&#xFF0C;&#x5F53;&#x8FD0;&#x884C;&#x671F;&#x4E0A;&#x4E0B;&#x6587;&#x88AB;&#x9500;&#x6BC1;&#xFF0C;&#x6D3B;&#x52A8;&#x5BF9; &#x8C61;&#x4E5F;&#x968F;&#x4E4B;&#x9500;&#x6BC1;&#x3002;<br>    &#x5728;&#x51FD;&#x6570;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6CA1;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x90FD;&#x4F1A;&#x7ECF;&#x5386;&#x4E00;&#x6B21;&#x6807;&#x8BC6;&#x7B26;&#x89E3;&#x6790;&#x8FC7;&#x7A0B;&#x4EE5;&#x51B3;&#x5B9A;&#x4ECE;&#x54EA;&#x91CC;&#x83B7;&#x53D6;&#x548C;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x3002;&#x8BE5;&#x8FC7;&#x7A0B;&#x4ECE;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x5934;&#x90E8;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4ECE;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x5F00;&#x59CB;&#x641C;&#x7D22;&#xFF0C;&#x67E5;&#x627E;&#x540C;&#x540D; &#x7684;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x5982;&#x679C;&#x627E;&#x5230;&#x4E86;&#x5C31;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x5BF9;&#x5E94;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x627E;&#x5230;&#x7EE7;&#x7EED;&#x641C;&#x7D22;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x641C;&#x7D22;&#x5B8C;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x90FD;&#x672A;&#x627E;&#x5230;&#xFF0C;&#x5219;&#x8BA4;&#x4E3A;&#x8BE5;&#x6807;&#x8BC6;&#x7B26;&#x672A;&#x5B9A;&#x4E49;&#x3002;&#x51FD;&#x6570; &#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x90FD;&#x8981;&#x7ECF;&#x5386;&#x8FD9;&#x6837;&#x7684;&#x641C;&#x7D22;&#x8FC7;&#x7A0B;&#x3002;<br>&#x58F0;&#x660E;&#xFF1A;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x7406;&#x89E3;&#x7684;&#x6BD4;&#x8F83;&#x6D45;&#x663E;&#xFF0C;&#x76F4;&#x63A5;&#x590D;&#x5236;&#x4E86;<a href="http://www.cnblogs.com/lhb25/archive/2011/09/06/javascript-scope-chain.html&#x91CC;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x7559;&#x7740;&#x56DE;&#x5934;&#x770B;&#x3002;" target="_blank" rel="external">http://www.cnblogs.com/lhb25/archive/2011/09/06/javascript-scope-chain.html&#x91CC;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x7559;&#x7740;&#x56DE;&#x5934;&#x770B;&#x3002;</a></p>


                <hr>

                
                <!-- 多说 Share start -->
                <div class="ds-share"
                    style="text-align: right"
                    data-thread-key="2016/08/07/关于javascript的一些知识总结/"
                    data-title="关于javascript的一些知识总结"
                    data-url="http://www.chengquanwei.com/2016/08/07/关于javascript的一些知识总结/"
                    data-images="http://www.chengquanwei.com/2016/08/07/关于javascript的一些知识总结/img/post-default.jpg"
                    data-content="&#x80CC;&#x666F;&#xFF1A;&#x516C;&#x53F8;&#x89C9... | 以手筑城 blog " >
                    <div class="ds-share-inline">
                      <ul  class="ds-share-icons-16">
                        <li data-toggle="ds-share-icons-more"><a class="ds-more" href="#">分享到：</a></li>
                        <li><a class="ds-wechat flat" href="javascript:void(0);" data-service="wechat">微信</a></li>
                        <li><a class="ds-weibo flat" href="javascript:void(0);" data-service="weibo">微博</a></li>
                        <li><a class="ds-douban flat" href="javascript:void(0);" data-service="douban">豆瓣</a></li>
                      </ul>
                      <div class="ds-share-icons-more">
                      </div>
                    </div>
                <hr>
                </div>
                <!-- 多说 Share end-->
                

                <ul class="pager">
                    
                    
                        <li class="next">
                            <a href="/2016/07/24/垃圾回收机制/" data-toggle="tooltip" data-placement="top" title="垃圾回收机制">Next Post &rarr;</a>
                        </li>
                    
                </ul>

                
                <!-- 多说评论框 start -->
                <div class="comment">
                    <div class="ds-thread"
                        data-thread-key="2016/08/07/关于javascript的一些知识总结/"
                        data-title="关于javascript的一些知识总结"
                        data-url="http://www.chengquanwei.com/2016/08/07/关于javascript的一些知识总结/" >
                    </div>
                </div>
                <!-- 多说评论框 end -->
                

                

            </div>

            <div class="hidden-xs col-sm-3 toc-col" >
                <div class="toc-wrap">
                    
                </div>
            </div>
        </div>

        <div class="row">
            <!-- Sidebar Container -->

            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                sidebar-container">

                <!-- Featured Tags -->
                
                <section>
                    <!-- no hr -->
                <h5 class="text-center">
                    <a href="/tags/">FEATURED TAGS</a>
                </h5>
                    <div class="tags">
                        
                          <a class="tag" href="/tags/#javascript" title="javascript">javascript</a>
                        
                    </div>
                </section>
                

                <!-- Friends Blog -->
                
            </div>
        </div>

    </div>
</article>


<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
<script type="text/javascript">
    // dynamic User by Hux
    var _user = 'chengquanwei';

    // duoshuo comment query.
    var duoshuoQuery = {short_name: _user };
    (function() {
        var ds = document.createElement('script');
        ds.type = 'text/javascript';ds.async = true;
        ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
        ds.charset = 'UTF-8';
        (document.getElementsByTagName('head')[0]
         || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
</script>
<!-- 多说公共JS代码 end -->







    <!-- Footer -->
    <!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                
                
                
                    <li>
                        <a target="_blank" href="https://www.zhihu.com/people/aa">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa  fa-stack-1x fa-inverse">知</i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank" href="http://weibo.com/1742460991">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-weibo fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                

                

                

                </ul>
                <p class="copyright text-muted">
                    Copyright &copy; 以手筑城 2017 
                    <br>
                    <!--Theme by <a href="https://github.com/Kaijun/">Kaijun</a>-->
                    <!--<span style="display: inline-block; margin: 0 5px;">-->
                        <!--<i class="fa fa-heart"></i>-->
                    <!--</span> -->
                    Theme by <a href="http://ehazon.github.io/">Haojen Ma</a>
                    <!--<iframe-->
                        <!--style="margin-left: 2px; margin-bottom:-5px;"-->
                        <!--frameborder="0" scrolling="0" width="91px" height="20px"-->
                        <!--src="https://ghbtns.com/github-btn.html?user=kaijun&repo=hexo-theme-huxblog&type=star&count=true" >-->
                    <!--</iframe>-->
                </p>
            </div>
        </div>
    </div>
</footer>

<!-- jQuery -->
<script src="/js/jquery.min.js"></script>

<!-- Bootstrap Core JavaScript -->
<script src="/js/bootstrap.min.js"></script>

<!-- Custom Theme JavaScript -->
<script src="/js/blog.js"></script>


<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>


<!-- jquery.tagcloud.js -->
<script>
    // only load tagcloud.js in tag.html
    if($('#tag_cloud').length !== 0){
        async("http://www.chengquanwei.com/js/jquery.tagcloud.js",function(){
            $.fn.tagcloud.defaults = {
                //size: {start: 1, end: 1, unit: 'em'},
                color: {start: '#bbbbee', end: '#0085a1'},
            };
            $('#tag_cloud a').tagcloud();
        })
    }
</script>

<!--fastClick.js -->
<script>
    async("http://cdn.bootcss.com/fastclick/1.0.6/fastclick.min.js", function(){
        var $nav = document.querySelector("nav");
        if($nav) FastClick.attach($nav);
    })
</script>


<!-- Google Analytics -->




<!-- Baidu Tongji -->

<script>
    var _baId = '4cc1f2d8f3067386cc5cdb626a202900';
    // Originial
    var _hmt = _hmt || [];
    (function() {
        var hm = document.createElement("script");
        hm.src = "//hm.baidu.com/hm.js?" + _baId;
        var s = document.getElementsByTagName("script")[0];
        s.parentNode.insertBefore(hm, s);
    })();
</script>


<!-- Side Catalog -->


    <!--wechat title img-->
    <img class="wechat-title-img" src="img/avatar_man_2.png">
</body>

</html>
